<?php
/**
 * Copyright (c) 2017, 杰利信息科技有限公司 dev.jelly-tec.com
 * 摘    要：Home.class.php
 * 作    者：wangld
 * 修改日期：2017/10/17
 */

namespace App\Controller;

use Xiaotu\Controller;

class Home extends Controller
{
    public function indexAction()
    {
        echo 'Home->index()';
    }

    public function helloAction()
    {
        $data = array(
            'title' => 'Hello, World!',
            'data' => array(
                array(
                    'id' => '1',
                    'cid' => '1',
                    'title' => '超搞,干冷干冷的一组冷笑话',
                    'content' => '矿泉水爱上了方便面，鼓起勇气向她表白，却被无情的拒绝了。矿泉水问：“为什么？”方便面不屑地说：“切，就你？一点热乎劲都没有，还想泡我１',
                    'md5' => 'cf38597dfc36a5cd6cc615e0b838d5fe',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '2',
                    'cid' => '1',
                    'title' => '冷人恶搞,冷在颠覆',
                    'content' => '万有引力最早是我国一个海南人发现的。比欧洲早200年。没有牛顿出名。因为他当时是在椰子树下乘凉。一个椰子掉下来把他砸成重伤从此丧失了语言能力。',
                    'md5' => '16cc9fd1a109a939a1cabfac2fd35ee9',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '3',
                    'cid' => '1',
                    'title' => '生活里的雷事冷笑话',
                    'content' => '泥瓦匠发现新来的学徒站在一堆水泥堆前发呆，怒问：“你怎么不干活，发什么呆？”学徒：“我双手老是发抖。”泥瓦匠说：“哦，那你去那边筛沙子去吧１',
                    'md5' => 'cb7f5074649fbfac48f484053ce5c448',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '4',
                    'cid' => '1',
                    'title' => 'iPhone带给我们的除了山寨,还有装B',
                    'content' => '库克来到中国后，想了解一下中国人使用iphone4s的情况，于是他走进地铁，看到满车的人都在用iphone，感到很欣慰。他问一个正在用iphone看电影的小姑娘：“你觉得这个手机用起来怎么样啊？”小姑娘笑着说：“稍等，手机没电了我换块电池……”库克惊了，竟然还是双卡双待！',
                    'md5' => '4aa9e25838f10f1f7cbd8e428a168a4d',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '5',
                    'cid' => '1',
                    'title' => '生活里处处皆有冷笑话',
                    'content' => '早上体检，需要抽血。扎第一针的护士说我太胖，找不到血管。扎第二针的护士说我皮太厚，扎不透。扎第三针的护士说前两个护士是新来的。。。',
                    'md5' => 'f71af784060af9835b6ef1c7f80228ed',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '6',
                    'cid' => '1',
                    'title' => '巨搞的穿越版冷笑话',
                    'content' => '话说李世民穿越到清朝，见到了林黛玉。惊呼：众里寻你千百度，蓦然回首，你却在清朝贾府村里祝黛玉说：还上什么百度，现在都微博了。',
                    'md5' => '4bf85f5a016b9d834db30c90be41b31a',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '7',
                    'cid' => '1',
                    'title' => '巨搞笑的新鲜雷人冷段子',
                    'content' => '元宵灯会上，有人出了这样一句歇后语“张飞碰见李逵---”几个不同职业的人分别续道：历史学家：没影的事！气象工作者：雷霆大作！作家：英雄惜英雄！警察：黑对黑！',
                    'md5' => '76835d822736ae784ba851c81d230756',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '8',
                    'cid' => '1',
                    'title' => '医生和生意人的冷笑话',
                    'content' => '扁鹊见蔡桓公，立有间.扁鹊曰：君有疾在腠理，不治将恐深.桓侯曰：寡人无疾.扁鹊：走两步！没病走两步！',
                    'md5' => 'bd2762a103b50528503510dc0a18b66c',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '9',
                    'cid' => '1',
                    'title' => '恶心、尴尬的糗事冷死人',
                    'content' => '某人在澡堂洗浴，用手掬洗操水漱口。浴客们都皱着眉头。有人道：“你怎么这么不讲卫生？”那人拱拱手说：“我吐在外边就是了。”',
                    'md5' => '53cb24cbc9f24eba8f46169d02de270e',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '10',
                    'cid' => '1',
                    'title' => '神话与武侠,乱搞一通',
                    'content' => '甲在看报纸，看着看着突然对旁边的阿呆说：阿呆，报纸上有你的老家的消息了！阿呆感兴趣地问：真的吗？在哪？阿呆接过报纸一看：“今晚天文爱好者可以观赏到‘火星冲日’奇观”......',
                    'md5' => 'edf1e61c073ea0b0a1059fabd7f5c69e',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '11',
                    'cid' => '1',
                    'title' => '冷幽默冷的你嘿嘿一笑',
                    'content' => 'a：“我家的狗实在太聪明了,每天早上都会衔当天的报纸来给我。”b：“这有什么，很多人家的狗都会这样。”a：“可是我家没订报纸啊１',
                    'md5' => '25d159a5e5c9be4f3ac93493dc4237a6',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '12',
                    'cid' => '1',
                    'title' => '冷人雷事,一句话爆笑',
                    'content' => '苍蝇没事的时候为什么要搓搓手，搓搓脚？开饭之前先洗手…',
                    'md5' => '0b36f5d3ed3abc81c78c5cc00bb3f697',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '13',
                    'cid' => '1',
                    'title' => '爆笑雷人,雷不倒不算.',
                    'content' => '老妈在看电视，老爸在沙发上睡着了。。。电视剧的声音：我走了埃。。老爸：走啥，再坐会呗。老妈：。。。。。',
                    'md5' => 'dc639810f1932e44bb3dc97bdf07f2b2',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '14',
                    'cid' => '1',
                    'title' => '内涵搞笑滴冷言囧语',
                    'content' => '小学时候写作文最爱用的就是省略号，因为它能占两个格……',
                    'md5' => '1d9969ac546d3e054c3a4f38adae0865',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '15',
                    'cid' => '1',
                    'title' => '天不变暖,冷笑话持续',
                    'content' => '两个好友聊天。a：“昨天借给了那个考古学家一万元。”b：“那你别指望还了，100年人家跟本不放到眼里。”',
                    'md5' => '7a62245e735d32bf75e791e87273867d',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '16',
                    'cid' => '1',
                    'title' => '巨冷,冰天雪地的冷笑话',
                    'content' => '古时有一小国，因战事频频导致国库不支。皇帝慌忙叫来朝中一个大臣，命其将自己家产充公，以做军费。大臣不愿却也不敢抗命，只怯怯问了一句：“朝中大臣那么多，为何是我？”皇帝走到他的面前，拍拍他的肩膀说：“因为爱卿，不会轻易悲伤……”',
                    'md5' => 'd67c584c0e8193dafc176d97f855d265',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '17',
                    'cid' => '1',
                    'title' => '短小内涵的冷幽默。',
                    'content' => '一日，煮鸡蛋碰上了煎鸡蛋，煎鸡蛋说：“蛋哥啊~做蛋不要太滑了。”然后煮鸡蛋说：“蛋弟呀，做蛋不能太油了１煎鸡蛋。。。。。。',
                    'md5' => 'a739ec7b340752ac56da95816f4604f4',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '18',
                    'cid' => '1',
                    'title' => '经典逗人的冷笑话',
                    'content' => '有一次，一位姑娘到外出办事，突然内急，便走到一个厕所门前，问厕所门口的一个人：“先生，请问这是女厕吗？”那人答道：“不知道，我从来没进去过１',
                    'md5' => 'd486fd621df003b816714ecf6d08029f',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '19',
                    'cid' => '1',
                    'title' => '有点神乎其神的冷笑话',
                    'content' => '老头道：那日华山论剑，先是他运起黯然销魂掌，破了我的七十二路空明拳；然后我改打降龙十八掌，却不防他伸开右手食指中指，竟是六脉神剑商阳剑和中冲剑并用，又胜我一筹。可见天下武功彼此克制，武学之道，玄之又玄！少年听得心驰目眩，正要再问，老太太骂道：猜拳就猜拳，说得这般威风！',
                    'md5' => '31810999e0872f3df0a8434a8dc3b85f',
                    'update_time' => '2017-06-04 22:10:20',
                ),
                array(
                    'id' => '20',
                    'cid' => '1',
                    'title' => '让人出冷汗的冷笑话',
                    'content' => '画家到湖边写生，看到湖面上悠悠的荡漾着飘逸的金鱼，他心有灵犀，摊开画纸，画了起来，为了能够画的更细致又不惊跑金鱼，他一点一点的往金鱼边上靠。越来越清晰。。。最后看清楚了，嘴里出现了骂声：“这tm原来是个香肠袋埃”',
                    'md5' => '02d1eb262cb7566b9043de1ea757a600',
                    'update_time' => '2017-06-04 22:10:20',
                )
            )
        );
        $this->display('home/hello.html', $data);
    }
}

